////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
    Заголовочный файл драйвера работы с адресными светодиодными лентами.
	разработал Николаев Сергей (г. Кулебаки).
	Все права защищены.
*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#ifndef _INC_ADDR_LEDS_DRIVER_H_
#define _INC_ADDR_LEDS_DRIVER_H_

    #ifdef __ASSEMBLER__

        #########################################################################################################
        # 1. Настройки
        #########################################################################################################

        # 1.1 Адрес регистра порта вывода, к которому подключена адресная лента
        PORT_REG_ADDR = 0x05

        # 1.2 Адрес регистра настройки направления порта, к которому подключена адресная лента
        PORT_DIRECTION_REG_ADDR = (PORT_REG_ADDR - 1)

        # 1.3 Номер разряда ножки порта вывода, к которому подключена адресная лента
        PIN_NUM = 0 

        ######################################################################################################
        # 2. Объявление функций, которые будут видны за пределом модуля
        ######################################################################################################

        .text

        .global addr_leds_init
        .global addr_leds_colors_apply
        
    #endif

    #ifndef __ASSEMBLER__

        #include <stdint.h>  

        void addr_leds_init(void);
        void addr_leds_colors_apply(const uint16_t color_values_array_size, uint8_t * color_values_array);

    #endif
    
#endif